alibaba/AliOS-Things/platform/mcu/stm32l4xx_cube/hal/hal_uart_stm32l4.c
            if(rx_count==expect_size)
            {
                break;
            }
        }
        if(rx_count==expect_size)
        {
            break;
        }

        if(RHINO_SUCCESS==aos_sem_wait(&stm32_uart[uart->port].uart_rx_sem, timeout))
        {
            while(stm32_uart[uart->port].uart_rx_out != stm32_uart[uart->port].uart_rx_in)
            {
                pdata[rx_count++] = stm32_uart[uart->port].UartRxBuf[stm32_uart[uart->port].uart_rx_out++];
                if(stm32_uart[uart->port].uart_rx_out == uartIns->attr.max_buf_bytes)
                {
                    stm32_uart[uart->port].uart_rx_out = 0;
                }

                if(rx_count==expect_size)
                {
                    break;
                }
            }
        }
        else
        {
            break;
        }
    }

    if (recv_size != NULL)
    {
        *recv_size = rx_count;
    }

    if(rx_count != 0)
    {
        ret = 0;
    }
    else
    {
        ret = -1;
    }
    
    
    return ret;
}

#ifdef WORKAROUND_DEVELOPERBOARD_DMA_UART
static uint8_t g_err_cnt = 0;
static int8_t uart_dma_err_workaround(uart_dev_t *uart)
{
   int8_t ret = 0;
   uint32_t uart_cr1_peie = READ_BIT(stm32_uart[uart->port].hal_uart_handle.Instance->CR1, USART_CR1_PEIE);
   uint32_t uart_ins_cr3_eie = READ_BIT(stm32_uart[uart->port].hal_uart_handle.Instance->CR3, USART_CR3_EIE);
   uint32_t uart_ins_cr3_dmar = READ_BIT(stm32_uart[uart->port].hal_uart_handle.Instance->CR3, USART_CR3_DMAR);

   if (uart_cr1_peie == 0 && uart_ins_cr3_eie == 0 && uart_ins_cr3_dmar == 0)
     g_err_cnt++;
   if (g_err_cnt == 5) {
    ret = -1;
    g_err_cnt = 0;
   } else
   ret = 0;

  return ret;

}
#endif

static int32_t uart_receive_dma(uart_dev_t *uart, void *data, uint32_t expect_size,
                      uint32_t *recv_size, uint32_t timeout)
{
    uint8_t *pdata = (uint8_t *)data;  
    uint32_t rx_count = 0;
    int32_t ret = -1;

    UART_MAPPING* uartIns = GetUARTMapping(uart->port);

    if (uartIns == NULL) {
        return ret;
    }

    if (stm32_uart[uart->port].uart_error_count) {
        printf("WARNING : uart %d have already lose %d byte \r\n", uart->port, stm32_uart[uart->port].uart_error_count);
    }
    
    while ( rx_count < expect_size )
    {
        while((stm32_uart[uart->port].uart_rx_out != stm32_uart[uart->port].uart_rx_in) || stm32_uart[uart->port].RxBuf_is_full)
        {
            stm32_uart[uart->port].RxBuf_is_full =0;
            pdata[rx_count++] = stm32_uart[uart->port].UartRxBuf[stm32_uart[uart->port].uart_rx_out++];

            if(stm32_uart[uart->port].uart_rx_out == uartIns->attr.max_buf_bytes)
            {
                stm32_uart[uart->port].uart_rx_out = 0;
            }
            
            if(rx_count==expect_size)
            {
                break;
            }
        }
        if(rx_count==expect_size)
        {
            break;
        }

        if(RHINO_SUCCESS==aos_sem_wait(&stm32_uart[uart->port].uart_rx_sem, timeout))
        {

            while(stm32_uart[uart->port].uart_rx_out != stm32_uart[uart->port].uart_rx_in)
            {
                pdata[rx_count++] = stm32_uart[uart->port].UartRxBuf[stm32_uart[uart->port].uart_rx_out++];
                if(stm32_uart[uart->port].uart_rx_out == uartIns->attr.max_buf_bytes)
                {
                    stm32_uart[uart->port].uart_rx_out = 0;
                }

                if(rx_count==expect_size)
                {
                    break;
                }
            }
        }
        else
        {
            break;
        }

        /* check DMA status
         * make sure DMA is active when buffer has space to receive new data
         * if(stm32_uart[uart->port].uart_dma_stop ==1)
         * EN bit in CR register will be cleared by hardware when a DMA end of transfer
         */
        uint32_t cr1its     = READ_REG(stm32_uart[uart->port].hal_uart_handle.hdmarx->Instance->CCR);
        if(cr1its & DMA_CCR_EN == RESET)
        {
            if((stm32_uart[uart->port].uart_rx_in==0 &&stm32_uart[uart->port].uart_rx_out >= (uartIns->attr.max_buf_bytes)/2)
                ||((stm32_uart[uart->port].uart_rx_in == (uartIns->attr.max_buf_bytes)/2 )&& (stm32_uart[uart->port].uart_rx_out <= (uartIns->attr.max_buf_bytes)/2))
            ||((stm32_uart[uart->port].uart_rx_in == stm32_uart[uart->port].uart_rx_out) && !stm32_uart[uart->port].RxBuf_is_full))
            {
                if(HAL_UART_Receive_DMA(&(stm32_uart[uart->port].hal_uart_handle),(uint8_t*)&stm32_uart[uart->port].UartRxBuf[stm32_uart[uart->port].uart_rx_in],(uartIns->attr.max_buf_bytes)/2)!= HAL_OK)
                {
                    Error_Handler(); 
                }
                stm32_uart[uart->port].uart_dma_stop =0;
                stm32_uart[uart->port].previous_dma_leftbyte = (uartIns->attr.max_buf_bytes)/2;
            }
        }

    }

    if (recv_size != NULL)
    {
        *recv_size = rx_count;
    }

    if(rx_count != 0)
    {
        ret = 0;
    }
    else
    {
#ifdef WORKAROUND_DEVELOPERBOARD_DMA_UART
       if (uart_dma_err_workaround(uart)) {
            printf("uart dma fail, workaround!!!!\n");
            ret = 1;
        } else
#endif
        ret = -1;
    }

    return ret;
}

int32_t hal_uart_finalize(uart_dev_t *uart)
{
    int32_t ret = -1;
    UART_MAPPING* uartIns = NULL;
    
    if (uart == NULL) {
        return -1;
    }

    uartIns = GetUARTMapping(uart->port);
    if( NULL== uartIns ){ 
        return -1;
    }

    if (stm32_uart[uart->port].inited == 0) {
        return -1;
    }
    
    ret = HAL_UART_DeInit(&stm32_uart[uart->port].hal_uart_handle);
    if(NULL != stm32_uart[uart->port].UartRxBuf){
        free(stm32_uart[uart->port].UartRxBuf);
        stm32_uart[uart->port].UartRxBuf = NULL;
    }

    if (aos_sem_is_valid(&stm32_uart[uart->port].uart_tx_sem)) {
        aos_sem_free(&stm32_uart[uart->port].uart_tx_sem);
    }
    
    if (aos_mutex_is_valid(&stm32_uart[uart->port].uart_tx_mutex)) {
        aos_mutex_free(&stm32_uart[uart->port].uart_tx_mutex);
    }

    if (aos_sem_is_valid(&stm32_uart[uart->port].uart_rx_sem)) {
        aos_sem_free(&stm32_uart[uart->port].uart_rx_sem);
    }

    if (aos_mutex_is_valid(&stm32_uart[uart->port].uart_rx_mutex)) {
        aos_mutex_free(&stm32_uart[uart->port].uart_rx_mutex);
    }

    stm32_uart[uart->port].inited = 0;
    return ret;
}

int32_t uart_dataWidth_transform(hal_uart_data_width_t data_width_hal,
        uint32_t *data_width_stm32l4)
{
    uint32_t data_width = 0;
    int32_t ret = 0;

